GOV_LINKS = {
    "江西省农业农村厅":"http://nync.jiangxi.gov.cn/search5/html/searchResult.html?siteCode=3600000029&searchWord=%25E5%2586%259C%25E4%25B8%259A&column=%25E5%2585%25A8%25E9%2583%25A8&left_right_index=0&searchSource=1",
    "南昌市农业农村局":"https://nyj.nc.gov.cn/",
    "景德镇市农业农村局":"https://nyncj.jdz.gov.cn/",
    "萍乡市农业农村局":"https://nyncj.pingxiang.gov.cn/",
    "九江市农业农村局":"https://nyncj.jiujiang.gov.cn/",
    "新余市农业农村局":"https://nyj.xinyu.gov.cn/",
    "鹰潭市农业农村粮食局":"http://nynclsj.yingtan.gov.cn/",
    "赣州市农村农业网":"https://ny.ganzhou.gov.cn/",
    "吉安市农业农村局":"http://agri.jian.gov.cn/",
    "宜春市农业农村局":"http://nyncj.yichun.gov.cn/",
    "抚州市农业农村局":"http://nyj.jxfz.gov.cn/index.html",
    "上饶市人民政府-市农业农村局":"https://www.zgsr.gov.cn/nyj/bindex.shtml"
}

KEY_MAP = {
    "农业生产核心":{
        "农业与种植":["种植","种植业","种粮","农作物","种业","良种","种质资源","育种创新"],
        "农机与农田":["农机","农业机械","农机购置补贴","农田","耕地","高标准农田","耕地保护","测土配方"]
    },
    "农业产业与产品":{
        "畜牧渔业":["畜牧","畜牧业","生猪","能繁母猪","渔业","水产","水产养殖"],
        "农资与农产品":["农资","种子","化肥","农药","农产品","农副产品","地理标志产品","农产品质量安全"],
    },
    "农业支持政策":{
        "金融保险":["农业保险","农业贷款","信贷担保","普惠金融"],
        "财政补贴":["农业补贴","种粮补贴","农资补贴","农机补贴","保费补贴"]
    },
    "乡村振兴与改革":{
        "乡村发展":["乡村振兴","农村人居环境","数字乡村","农村基础设施"],
        "人才与经营":["高素质农民","新型职业农民","乡村工匠","农民合作社","家庭农场","村集体经济"],
        "产权改革":["农村集体产权改革","土地流转","宅基地改革"]
    },
    "宏观政策与生态农业":{
        "宏观政策":["粮食安全","农业现代化","中央一号文件","农业规划","稳产保供"],
        "生态农业":["绿色农业","生态农业","农药化肥减量","秸秆还田","农业面源污染治理"]
    }
}